/*********************************************************/
/*  main.c                                               */
/*                                                       */
/*  階層型ニューロネットプログラム                       */
/*  学習機                                               */
/*  自己符号化機(Auto Encoder)                           */
/*                                                       */
/*  Usage:                                               */
/*  # main < aedata1.txt                                 */
/*********************************************************/
#include "lrnproc.h"

int main(){
	
	return lrnproc();
	
}


